import utils


weighted_votes = [
    [-96, -44, -66, -42, -10],  # Iteração 1 (Índice 0)
    [-10, 0, 0, -30, -17],      # Iteração 2 (Índice 1)
    [16, 0, 9, 66, 24],         # Iteração 3
    [0, -72, 30, 51, 16],       # Iteração 4
    [0, -24, 32, 42, -26],      # Iteração 5
    [26, -28, -52, -11, 0],     # Iteração 6
    [0, 16, -15, 28, 24],       # Iteração 7
    [12, 15, 14, 39, 60],       # Iteração 8
    [-26, 68, 24, 32, -40],     # Iteração 9
    [-17, 0, 72, -20, 30],      # Iteração 10
    [-32, 0, -76, -45, 0],      # Iteração 11
    [-36, 90, 66, 56, 0],       # Iteração 12
    [-34, -52, -16, 0, 72],     # Iteração 13
    [16, 40, -51, 96, -46],     # Iteração 14
    [-14, 0, -20, 108, 64],     # Iteração 15
    [7, -90, -21, -30, -16],    # Iteração 16
    [0, 44, 11, 90, 24],        # Iteração 17
    [8, 12, 0, -2, 34],         # Iteração 18
    [28, 16, 32, 57, -45],      # Iteração 19
    [-28, 11, 76, 28, 32],      # Iteração 20
    [-28, 32, 15, -33, 22],     # Iteração 21
    [22, -54, 13, 34, 16],      # Iteração 22
    [0, 30, 11, 0, 33],         # Iteração 23
    [0, 26, 0, -12, -18],       # Iteração 24
    [-24, -68, -24, 28, 40],    # Iteração 25
    [0, 52, 84, 39, 0],         # Iteração 26
    [-22, 0, 0, 0, -12],        # Iteração 27
    [-17, 30, -40, 36, -52],    # Iteração 28
    [-56, 54, 0, 0, 0],         # Iteração 29
    [0, 0, -14, 18, 0],         # Iteração 30
    [32, 22, 24, 0, 33],        # Iteração 31
    [72, 44, -114, 7, -30],     # Iteração 32
    [36, -96, 0, -14, -90],     # Iteração 33
    [0, -54, 36, 0, 30],        # Iteração 34
    [-17, 64, 42, -32, 15],     # Iteração 35
    [42, -32, -66, -10, 24],    # Iteração 36
    [66, 16, -40, -10, -48],    # Iteração 37
    [18, -36, 0, 0, -8],        # Iteração 38
    [30, -52, -13, -54, -12],   # Iteração 39
    [0, 14, 0, -24, -78],       # Iteração 40
    [-108, -48, -30, -26, -96], # Iteração 41
    [0, -39, 0, 45, 108],       # Iteração 42
    [84, -90, 0, -24, 12],      # Iteração 43
    [-32, 26, -36, 22, 0],      # Iteração 44
    [18, 114, 28, 68, 18],      # Iteração 45
    [0, -24, -18, 0, 26],       # Iteração 46
    [-36, 24, 40, -24, -48],    # Iteração 47
    [32, -68, 48, 0, 16],       # Iteração 48
    [-39, 32, 0, 0, 0],         # Iteração 49
    [0, 0, 0, 6, 15]            # Iteração 50 (Índice 49)
]

cont = 1
for weighted_vote in weighted_votes:
    cdf = round(utils.getCDF(weighted_vote), 2)
    print(f"{cont}: Weighted Votes: {weighted_vote} -------> CDF: {cdf}")
    cont += 1
